In [34]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [4]:
len(df["col2"].unique())

3

In [5]:
df["col2"].nunique()

3

In [7]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [11]:
#Conditional Select
df[(df["col2"]>df["col1"]) & (df["col2"]==444)]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [15]:
#apply function

def multBy2(x):
    return x*2

df['new']=df['col1'].apply(multBy2)
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [16]:
#delete a column or dropping a column
del df['new']
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [20]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
col1    4 non-null int64
col2    4 non-null int64
col3    4 non-null object
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

In [35]:
df.sort_values(by="col3")

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [25]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [28]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')